swak4Foam/Examples/RegionSolvers/cavityWithHeater/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        // Field Value
        value           uniform (1 0 0);
    }

    "fixedWall.*"
    {
        type            fixedValue;
        // Field Value
        value           uniform (0 0 0);
    }

    "cavity_to_(.+)Heater" {
        $fixedWallBottom;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
