swak4Foam/Examples/RegionSolvers/cavityWithHeater/0.org/bottomHeater/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 300;

boundaryField
{
    #include "${WM_PROJECT_DIR}/etc/caseDicts/setConstraintTypes"

    right
    {
        type            externalWallHeatFluxTemperature;
        kappaMethod     solidThermo;
        kappa $kappaMethod;
        kappaName none;
        mode            coefficient;
        h               uniform 1e3;
        Ta              uniform 350;
        value           $internalField;
    }
    left
    {
        $right;
        Ta              uniform 290;
    }
    bottom
    {
        type zeroGradient;
    }
    bottomHeater_to_cavity {
        type            compressible::turbulentTemperatureCoupledBaffleMixed;
        value           $internalField;
        Tnbr            T;
        kappaMethod     solidThermo;
        kappa $kappaMethod;
        kappaName none;
    }
    // solid_to_gas
    // {
    //     type            compressible::turbulentTemperatureCoupledBaffleMixed;
    //     value           $internalField;
    //     Tnbr            T;
    //     kappaMethod     solidThermo;
    // }
}


// ************************************************************************* //
